In [1]:
import pandas as pd
import matplotlib.pyplot as pl
import seaborn as sb
df = pd.read_csv("titanic_data_set.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
print "No. of Rows and Columns :: " + str(df.shape)

No. of Rows and Columns :: (891, 12)

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
df.describe(include=['O'])

                             Name   Sex    Ticket        Cabin Embarked
count                         891   891       891          204      889
unique                        891     2       681          147        3
top     Graham, Mr. George Edward  male  CA. 2343  C23 C25 C27        S
freq                            1   577         7            4      644

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
survived = df[df['Survived']==1]
survived.head()
print "Survived Passengers :: " + str(len(survived)) + "/891"

Survived Passengers :: 342/891

In [7]:
unsurvived = df[df['Survived']==0]
unsurvived.head()
print "UnSurvived Passengers :: " + str(len(unsurvived)) + "/891"

UnSurvived Passengers :: 549/891

In [8]:
s = (float(len(survived))/len(df)*100.0)
ns = (float(len(unsurvived))/len(df)*100.0)
print "Percentage of Survived Passengers :: %.2f" %(s) + "%"
print "Percentage of UnSurvived Passengers :: %.2f" %(s) + "%"
print "Total Passengers :: %d" %len(df)

Percentage of Survived Passengers :: 38.38%
Percentage of UnSurvived Passengers :: 38.38%
Total Passengers :: 891

In [9]:
print "Class Passengers\n" + str(df.Pclass.value_counts())

Class Passengers
3    491
1    216
2    184
Name: Pclass, dtype: int64

In [10]:
df.groupby('Pclass').Survived.value_counts()

Pclass  Survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: Survived, dtype: int64

In [11]:
df.groupby(["Pclass","Sex"]).Survived.value_counts()

Pclass  Sex     Survived
1       female  1            91
                0             3
        male    0            77
                1            45
2       female  1            70
                0             6
        male    0            91
                1            17
3       female  0            72
                1            72
        male    0           300
                1            47
Name: Survived, dtype: int64

In [12]:
df.groupby("Pclass").Sex.value_counts()

Pclass  Sex
1       male      122
        female     94
2       male      108
        female     76
3       male      347
        female    144
Name: Sex, dtype: int64

In [13]:
a = df.groupby(["Pclass","Sex"]).Survived.value_counts()
for key, values, in a.iteritems():
    print key, values

(1L, 'female', 1L) 91
(1L, 'female', 0L) 3
(1L, 'male', 0L) 77
(1L, 'male', 1L) 45
(2L, 'female', 1L) 70
(2L, 'female', 0L) 6
(2L, 'male', 0L) 91
(2L, 'male', 1L) 17
(3L, 'female', 0L) 72
(3L, 'female', 1L) 72
(3L, 'male', 0L) 300
(3L, 'male', 1L) 47

In [14]:
per_class1_female_survived = a[1,'female',1].astype('float32')/(a[1,'female',1]+a[1,'female',0]).astype('float32')
f1 = per_class1_female_survived*100
print "Percentage of Female Passengers Survived from Class-1 :: %.2f" %(f1)

Percentage of Female Passengers Survived from Class-1 :: 96.81

In [15]:
per_class1_male_survived = a[1,'male',1].astype('float32')/(a[1,'male',1]+a[1,'male',0]).astype('float32')
m1 = per_class1_male_survived*100
print "Percentage of Male Passengers Survived from Class-1 :: %.2f" %(m1)

Percentage of Male Passengers Survived from Class-1 :: 36.89

In [16]:
per_class2_female_survived = a[2,'female',1].astype('float32')/(a[2,'female',1]+a[2,'female',0]).astype('float32')
f2 = per_class2_female_survived*100
print "Percentage of Female Passengers Survived from Class-2 :: %.2f" %(f2)

Percentage of Female Passengers Survived from Class-2 :: 92.11

In [17]:
per_class2_male_survived = a[2,'male',1].astype('float32')/(a[2,'male',1]+a[2,'male',0]).astype('float32')
m2 = per_class2_male_survived*100
print "Percentage of Male Passengers Survived from Class-2 :: %.2f" %(m2)

Percentage of Male Passengers Survived from Class-2 :: 15.74

In [18]:
per_class3_female_survived = a[3,'female',1].astype('float32')/(a[3,'female',1]+a[3,'female',0]).astype('float32')
f3 = per_class3_female_survived*100
print "Percentage of Female Passengers Survived from Class-3 :: %.2f" %(f3)

Percentage of Female Passengers Survived from Class-3 :: 50.00

In [19]:
per_class3_male_survived = a[3,'male',1].astype('float32')/(a[3,'male',1]+a[3,'male',0]).astype('float32')
m3 = per_class3_male_survived*100
print "Percentage of Male Passengers Survived from Class-3 :: %.2f" %(m3)

Percentage of Male Passengers Survived from Class-3 :: 13.54